
## Terraform Comment

**Project:** terraform/mathews-recurring-revenue-stg

**Command:** plan

**Outcome:** success

<details>
  <summary>
    <b>Output: </b>
  </summary>

  <pre>google_bigquery_dataset.raw: Refreshing state... [id=projects/mathews-recurring-revenue-stg/datasets/raw]
google_bigquery_table.google_sheets__incomes: Refreshing state... [id=projects/mathews-recurring-revenue-stg/datasets/raw/tables/google_sheets__incomes]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_project_iam_member.dbt_project["roles/bigquery.dataEditor"] will be created
  + resource "google_project_iam_member" "dbt_project" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:dbt-project@mathews-recurring-revenue-stg.iam.gserviceaccount.com"
      + project = "mathews-recurring-revenue-stg"
      + role    = "roles/bigquery.dataEditor"
    }

  # google_project_iam_member.dbt_project["roles/bigquery.user"] will be created
  + resource "google_project_iam_member" "dbt_project" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:dbt-project@mathews-recurring-revenue-stg.iam.gserviceaccount.com"
      + project = "mathews-recurring-revenue-stg"
      + role    = "roles/bigquery.user"
    }

  # google_service_account.dbt_project will be created
  + resource "google_service_account" "dbt_project" {
      + account_id                   = "dbt-project"
      + create_ignore_already_exists = true
      + description                  = "DBT Project Service Account"
      + disabled                     = false
      + display_name                 = "dbt-project"
      + email                        = "dbt-project@mathews-recurring-revenue-stg.iam.gserviceaccount.com"
      + id                           = (known after apply)
      + member                       = "serviceAccount:dbt-project@mathews-recurring-revenue-stg.iam.gserviceaccount.com"
      + name                         = (known after apply)
      + project                      = "mathews-recurring-revenue-stg"
      + unique_id                    = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: mathews-recurring-revenue-stg

To perform exactly these actions, run the following command to apply:
    terraform apply "mathews-recurring-revenue-stg"
</pre>
</details>
